In [32]:
import pandas as pd
import numpy as np

# Example Data

In [54]:
data = {'A':[10,20,np.nan,12],
       'B':[40,50,46,13],
       'C':[11,np.nan,np.nan,14]}

In [55]:
df = pd.DataFrame(data)

In [56]:
df

      A   B     C
0  10.0  40  11.0
1  20.0  50   NaN
2   NaN  46   NaN
3  12.0  13  14.0

# pd.isnull

https://pandas.pydata.org/docs/reference/api/pandas.isnull.html

In [37]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False   True
2   True  False  False
3  False  False  False

https://www.kite.com/python/answers/how-to-find-rows-with-nan-values-in-a-pandas-dataframe-in-python

In [43]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

In [44]:
df[df.isnull().any(axis=1)]

      A   B     C
1  20.0  50   NaN
2   NaN  60  33.0

# pd.isna

Which rows have NaN?

In [46]:
df.isna()

       A      B      C
0  False  False  False
1  False  False   True
2   True  False  False
3  False  False  False

https://stackoverflow.com/questions/43424199/display-rows-with-one-or-more-nan-values-in-pandas-dataframe

In [47]:
df.isna().any(axis=1)

0    False
1     True
2     True
3    False
dtype: bool

In [48]:
df[df.isnull().any(axis=1)]

      A   B     C
1  20.0  50   NaN
2   NaN  60  33.0

How many NaNs are there?

In [59]:
df

      A   B     C
0  10.0  40  11.0
1  20.0  50   NaN
2   NaN  46   NaN
3  12.0  13  14.0

In [61]:
df.isna().sum().sum()

3

In [60]:
df

      A   B     C
0  10.0  40  11.0
1  20.0  50   NaN
2   NaN  46   NaN
3  12.0  13  14.0

In [58]:
df.isna().any(axis=0)

A     True
B    False
C     True
dtype: bool